app/controllers/api/v1/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "adil.testing@amplifyd.io"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:user][:email])