app/controllers/api/v1/base_controller.rb

  def authenticate_request!
    begin
      payload = JsonWebToken.decode(auth_token)
      @current_user = User.find_by_id(payload["sub"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]