app/controllers/api/v1/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.query_parameters(params[:q]).desc_created_at.page(params[:page]).per(params[:per_page])

INSERT INTO "transactions" ("hash", "nonce", "from", "to", "gas", "txreceipt_status", "input", "confirmations", "created_at", "updated_at", "value") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @transaction = Transaction.new(transaction_params)
    if @transaction.save